src/cf/src/Documents/ТестированиеОбъектовМетаданных/ТестированиеОбъектовМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТестированиеОбъектовМетаданных</name>
  <posting>Deny</posting>
  <attributes>
    <name>СценарийТестирования</name>
    <type>
      <types>CatalogRef.СценарииТестированияОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗадания</name>
    <comment>Общее описание технического задания</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатПроверки</name>
    <comment>Резюме ответственного за проверку</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатистикаЭтаповПроверки</name>
    <comment>Отражается количество принятых и непринятых этапов проверки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияКонфигурации</name>
    <type>
      <types>CatalogRef.ВерсииКонфигураций</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбъектыНаПроверке</name>
    <attributes>
      <name>ОбъектМетаданных</name>
      <type>
        <types>CatalogRef.ОбъектыМетаданныхКонфигураций</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыПроверки</name>
    <attributes>
      <name>ЭтапПроверки</name>
      <type>
        <types>CatalogRef.ЭтапыПроверкиОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатЭтапа</name>
      <type>
        <types>EnumRef.РезультатЭтапаПроверки</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийРезультата</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыПроверкиМетаданных</name>
    <attributes>
      <name>ЭтапПроверки</name>
      <type>
        <types>CatalogRef.ЭтапыПроверкиОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектМетаданных</name>
      <type>
        <types>CatalogRef.ОбъектыМетаданныхКонфигураций</types>
      </type>
    </attributes>
    <attributes>
      <name>Проверено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Enums/РезультатЭтапаПроверки/РезультатЭтапаПроверки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РезультатЭтапаПроверки</name>
  <enumValues>
    <name>Принято</name>
  </enumValues>
  <enumValues>
    <name>НеПринято</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Documents/ТестированиеОбъектовМетаданных/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// отметка протестированных объектов метаданных
	Принято = 0;
	Для каждого стр Из ЭтапыПроверки Цикл
		Если стр.РезультатЭтапа=Перечисления.РезультатЭтапаПроверки.Принято Тогда
			Принято = Принято + 1;
		КонецЕсли;
	КонецЦикла;
	ПринятыОбъекты = ЭтапыПроверки.Количество()= Принято;
	
	Для каждого стр Из ОбъектыНаПроверке Цикл
		// отражение протокола этапов проверки в информационном поле
		Если стр.ОбъектМетаданных.ОбъектПротестирован = ПринятыОбъекты Тогда
			Продолжить;
		КонецЕсли;
		
		ОбъектОМ = стр.ОбъектМетаданных.ПолучитьОбъект();
		ОбъектОМ.Заблокировать();
		ОбъектОМ.ОбъектПротестирован = ПринятыОбъекты;
		ОбъектОМ.Записать();
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
